Revit 2026 API

# TextBoxData Constructor

---

Constructs a new instance of TextBoxData.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TextBoxData(
	string name
)
```
```vb
Public Sub New (
	name As String
)
```
```cpp
public:
TextBoxData(
	String^ name
)
```
```fsharp
new :
        name : string -> TextBoxData
```

#### Parameters

name String
    The internal name of the TextBoxData.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when  is passed for name. |
| ArgumentException | Thrown when an empty string is passed for name. |

#### Reference

TextBoxData Class

Autodesk.Revit.UI Namespace